Revit 2027 API
CitySet Class
An set that contains cities.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CitySet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CitySet : APIObject, IEnumerable
Public Class CitySet
	Inherits APIObject
	Implements IEnumerable
public ref class CitySet : public APIObject,
	IEnumerable
type CitySet =
    class
        inherit APIObject
        interface IEnumerable
    end
The CitySet type exposes the following members.
Constructors
Name | Description
CitySet | Initializes a new instance of the CitySet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size | Returns the number of cities that are in the set.
Top
Methods
Name | Description
Clear | Removes every city from the set, rendering it empty.
Contains | Tests for the existence of a city within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified city from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified city into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace